lib/zuora-core/src/test/resources/Discounts.json

{
  "success": true,
  "id": "2c92c0f8702e3e20017034c191dc41c0",
  "accountId": "2c92c0f8702e3e2001702fc612a52eb9",
  "accountNumber": "A00080708",
  "accountName": "0013E00001A3FJMQA3",
  "invoiceOwnerAccountId": "2c92c0f8702e3e2001702fc612a52eb9",
  "invoiceOwnerAccountNumber": "A00080708",
  "invoiceOwnerAccountName": "0013E00001A3FJMQA3",
  "subscriptionNumber": "A-S00081587",
  "version": 4,
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2020-02-10",
  "serviceActivationDate": "2020-02-10",
  "customerAcceptanceDate": "2020-02-21",
  "subscriptionStartDate": "2020-02-10",
  "termStartDate": "2020-02-10",
  "termEndDate": "2021-02-10",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 12.50,
  "totalContractedValue": 145.56,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "OpportunityName__QT": null,
  "GiftSubscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "6c18ed3b-59f5-654a-0000-0000000016a6",
  "NextVoucherDateTest__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "InitialPromotionCode__c": null,
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "QuoteType__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "GiftSerialNumber__c": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "2c92c0f8702e3e20017034c191fe41c4",
      "lastChangeType": "Add",
      "productId": "2c92c0f9574ee3de015753802a687612",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92c0f96f13e312016f146925297428",
      "ratePlanName": "Acquisition Discount - 25% off for 12 months",
      "ratePlanCharges": [
        {
          "id": "2c92c0f8702e3e20017034c191fe41c5",
          "originalChargeId": "2c92c0f8702e3e200170340bc6f21bb0",
          "productRatePlanChargeId": "2c92c0f96f13e312016f1469256c742a",
          "number": "C-00513446",
          "name": "Acquisition Discount - 25% off for 12 months",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "25%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 25.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-02-10",
          "effectiveEndDate": "2021-02-10",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0E-9,
          "dmrc": 0E-9,
          "tcv": 0E-9,
          "dtcv": 0E-9,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "2c92c0f8702e3e20017034c1921741c9",
      "productId": "2c92c0f9660fc4d70166107e71f5278f",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000043",
      "productRatePlanId": "2c92c0f8660fb5d601661081ea010391",
      "ratePlanName": "GW Oct 18 - Quarterly - Domestic",
      "ratePlanCharges": [
        {
          "id": "2c92c0f8702e3e20017034c1921741ca",
          "originalChargeId": "2c92c0f8702e3e2001702fc613212ec4",
          "productRatePlanChargeId": "2c92c0f8660fb5d601661081ea120393",
          "number": "C-00513440",
          "name": "GW Oct 18 - Quarterly - Domestic",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP37.5",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 37.500000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-02-21",
          "effectiveEndDate": "2021-02-10",
          "processedThroughDate": "2020-02-21",
          "chargedThroughDate": "2020-05-21",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 12.500000000,
          "dmrc": 12.500000000,
          "tcv": 145.564516125,
          "dtcv": 145.564516125,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "2c92c0f8702e3e20017034c1923141ce",
      "lastChangeType": "Add",
      "productId": "2c92c0f9574ee3de015753802a687612",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92c0f86f13cd1b016f14b77e940230",
      "ratePlanName": "Cancellation Save Discount - 20% off for 12 months",
      "ratePlanCharges": [
        {
          "id": "2c92c0f8702e3e20017034c1923141cf",
          "originalChargeId": "2c92c0f9702e4d4f0170349b58886349",
          "productRatePlanChargeId": "2c92c0f86f13cd1b016f14b77ec20232",
          "number": "C-00513448",
          "name": "Cancellation Save Discount - 20% off for 12 months",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "20%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 20.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-02-10",
          "effectiveEndDate": "2021-02-10",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0E-9,
          "dmrc": 0E-9,
          "tcv": 0E-9,
          "dtcv": 0E-9,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "2c92c0f8702e3e25017034c0950e0840",
      "lastChangeType": "Add",
      "productId": "2c92c0f9574ee3de015753802a687612",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92c0f86f13cd1b016f14b77e940230",
      "ratePlanName": "Cancellation Save Discount - 20% off for 12 months",
      "ratePlanCharges": [
        {
          "id": "2c92c0f8702e3e25017034c0950e0841",
          "originalChargeId": "2c92c0f8702e3e25017034c0950e0841",
          "productRatePlanChargeId": "2c92c0f86f13cd1b016f14b77ec20232",
          "number": "C-00513450",
          "name": "Cancellation Save Discount - 20% off for 12 months",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "20%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 20.000000000,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-03-01",
          "effectiveEndDate": "2021-02-10",
          "processedThroughDate": null,
          "chargedThroughDate": null,
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0E-9,
          "dmrc": 0E-9,
          "tcv": 0E-9,
          "dtcv": 0E-9,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}